Repository: phunkyfish/visualization.shadertoy
Catalog: visualization.shadertoy/resources/language/resource.language.*/strings.po
Languages: it_it

# Addon Summary
source: Visualizations from Shadertoy
it_it: Visualizzazioni da Shadertoy

# Addon Description
source: This music visualization is based on Shadertoy based GPU programs.
it_it: Questa visualizzazione musicale si basa sui programmi GPU basati su Shadertoy.

# #30000
source: General
it_it: Generale

# #30010
source: Choose one yourself
it_it: Scegline uno tu stesso

# #30011
source: Use your own shadertoy. Attention: Some shaders are not supported by some GPU's in performance!
it_it: Usa il tuo shadertoy. Attenzione: alcuni shader non sono supportati da alcune GPU in termini di prestazioni!

# #30012
source: Shadertoy file
it_it: File Shadertoy

# #30013
source: Shader as *.glsl
it_it: Shader come *.glsl

# #30014
source: Channel 0 as audio
it_it: Canale 0 come audio

# #30015
source: Use audio stream data on channel 0
it_it: Usa i dati del flusso audio sul canale 0

# #30016
source: Channel 0 texture image
it_it: Trama immagine del canale 0

# #30017
source: Channel 0 as *.png
it_it: Canale 0 come *.png

# #30018
source: Channel 1 as audio
it_it: Canale 1 come audio

# #30019
source: Use audio stream data on channel 1
it_it: Usa i dati del flusso audio sul canale 1

# #30020
source: Channel 1 texture image
it_it: Trama immagine del canale 1

# #30021
source: Channel 1 as *.png
it_it: Canale 1 come *.png

# #30022
source: Channel 2 as audio
it_it: Canale 2 come audio

# #30023
source: Use audio stream data on channel 2
it_it: Usa i dati del flusso audio sul canale 2

# #30024
source: Channel 2 texture image
it_it: Trama immagine del canale 2

# #30025
source: Channel 2 as *.png
it_it: Canale 2 come *.png

# #30026
source: Channel 3 as audio
it_it: Canale 3 come audio

# #30027
source: Use audio stream data on channel 3
it_it: Usa i dati del flusso audio sul canale 3

# #30028
source: Channel 3 texture image
it_it: Trama immagine del canale 3

# #30029
source: Channel 3 as *.png
it_it: Canale 3 come *.png

# #30030
source: Shadertoy Visualization
it_it: Visualizzazione Shadertoy

# #30031
source: Cannot read the JSON file. Please check the formatting is correct and the file is available.
it_it: Impossibile leggere il file JSON. Controlla che la formattazione sia corretta e che il file sia disponibile.

# #30032
source: Path to custom preset list
it_it: Percorso elenco preimpostazioni personalizzate

# #30033
source: Set the path to your custom JSON-formatted preset file. If no path is configured, the add-on will use the default preset file.
it_it: Imposta il percorso del file preimpostato personalizzato in formato JSON. Se non è configurato alcun percorso, l'add-on userà il file preimpostato predefinito.

# #30034
source: Configure a single shader
it_it: Configura un singolo shader

# #30035
source: Show help about preset file
it_it: Mostra la guida sul file preimpostato

# #30036
source: Open to read about creating the JSON-formatted preset file.
it_it: Apri per leggere informazioni sulla creazione del file preimpostato in formato JSON.

# #30037
source: Help about defining your own shaders in the JSON file
it_it: Aiuto su come definire i tuoi shader nel file JSON

# #30038
source: [B][I]JSON file for user defined shader lists[/I][/B] The file [B]presets.json[/B] is used to define custom shaders. A custom path to the shader files (GLSL) can be declared in the add-on settings. Contents of [B]presets.json[/B] should be: [I] 1.[/I] Name of preset. Either hardcoded string or defined in [I]resources/language/.../strings.po[/I] [I] 2.[/I] GLSL shader to use. If no custom path was declared, the default [B]resources/[/B] will be used. Set custom path to './' to use shaders from the same path as your [B]presets.json[/B] file. [I] 3.[/I] Channel value 0. Defines the texture to use (e.g. PNG file). Can also be set to "audio" to pass related stream data within texture. The PNG and GLSL files should be located in the same directory. [I] 4.[/I] Channel value 1 definition. [I] 5.[/I] Channel value 2 definition. [I] 6.[/I] Channel value 3 definition. [I] 7.[/I] [I][Optional][/I] append string [B]"gl_only"[/B] to make this preset only available to OpenGL. [B]Example:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* Default way used by the addon itself */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Description defined in strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Define custom file paths */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Preset only available to OpenGL (see 7) */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL and PNG files are in the same folder as presets.json */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Select texture image by file name, use default "resources/" dir */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
it_it: [B][I]File JSON per elenchi di shader definiti dall'utente[/I][/B] Il file [B]presets.json[/B] viene utilizzato per definire gli shader personalizzati. Un percorso personalizzato per i file shader (GLSL) può essere dichiarato nelle impostazioni dell'Add-on. Il contenuto di [B]presets.json[/B] dovrebbe essere: [I] 1.[/I] Nome del preset. Stringa hardcoded o definita in [I]resources/language/.../strings.po[/I] [I] 2.[/I] Shader GLSL da utilizzare. Se non è stato dichiarato alcun percorso personalizzato, verrà utilizzato il valore predefinito [B]resources/[/B]. Imposta il percorso personalizzato su './' per utilizzare gli shader dallo stesso percorso del file [B]presets.json[/B]. [I] 3.[/I] Valore del canale 0. Definisce la trama da utilizzare (es. file PNG). Può anche essere impostato su "audio" per passare i dati di flusso correlati all'interno della trama. I file PNG e GLSL dovrebbero trovarsi nella stessa directory. [I] 4.[/I] Definizione del valore del canale 1. [I] 5.[/I] Definizione del valore del canale 2. [I] 6.[/I] Definizione del valore del canale 3. [I] 7.[/I] [I][Facoltativo][/I] aggiungi la stringa [B]"gl_only"[/B] per rendere questo preset disponibile solo per OpenGL. [B]Esempio:[/B] [COLOR white][COLOR green]{[/COLOR] [COLOR blue]"presets"[/COLOR]:[ [COLOR gray]/* Default way used by the Add-on itself */[/COLOR] [ [COLOR red]"The Disco Tunnel by poljere"[/COLOR], [COLOR red]"discotunnel.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Description defined in strings.po */[/COLOR] [ 30100, [COLOR red]"audioeclipse.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Define custom file paths */[/COLOR] [ [COLOR red]"My own one"[/COLOR], [COLOR red]"/path/to/glsl/my.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]"/path/to/pngs/my_image.png"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Preset only available to OpenGL (see 7) */[/COLOR] [ [COLOR red]"Polar Beats by sauj123"[/COLOR], [COLOR red]"polarbeats.frag.glsl"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]""[/COLOR], [COLOR red]"gl_only"[/COLOR] ], [COLOR gray]/* GLSL and PNG files are in the same folder as presets.json */[/COLOR] [ [COLOR red]"Another one"[/COLOR], [COLOR red]"./another.frag.glsl"[/COLOR], [COLOR red]"./my_01.png"[/COLOR], [COLOR red]"./my_02.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ], [COLOR gray]/* Select texture image by file name, use default "resources/" dir */[/COLOR] [ [COLOR red]"Fractal Land by Kali"[/COLOR], [COLOR red]"fractalland.frag.glsl"[/COLOR], [COLOR red]"tex02.png"[/COLOR], [COLOR red]"tex15.png"[/COLOR], [COLOR red]"audio"[/COLOR], [COLOR red]""[/COLOR] ] ][COLOR green]}[/COLOR][/COLOR]
